# TODO текст бесплатного функционала
functional_free_text = f'Я могу рассказать тебе о баскетболе\n\n' \
            f'   1) История баскетбола\n\n' \
            f'   2) Элементы дриблинга\n\n' \
            f'   3) Про NBA\n\n' \
            f'   4) Про ВТБ'

# TODO текст функционала с подпиской
functional_sub_text =f'Я могу рассказать тебе о баскетболле\n\n' \
            f'   1) История баскетбола\n\n' \
            f'   2) Элементы дриблинга\n\n' \
            f'   3) Про NBA\n\n' \
            f'   4) Про ВТБ\n\n' \
            f'   5) Турнирная таблица NBA\n\n' \
            f'   6) Турнирная таблица ВТБ\n\n' \
            f'   7) Командный состав NBA\n\n' \
            f'   8) Игроков дня NBA' \
            f'   9) Дам ссылку на записи трасляций NBA и ВТБ\n\n' \
            f'   10) Найду видео или канал на YouTube\n\n' \
            f'   11) Музыкальный сборник'

# TODO текст описания подписки
sub_text = f'Преобретая подписку, вам будет доступен дополнительный функционал бота:\n\n' \
           f'1) Турнирная таблицу NBA\n\n' \
           f'2) Турнирная таблица ВТБ\n\n' \
           f'3) Просмотр состава команд NBA\n\n' \
           f'4) Ccылуи на записи и прямые трансляции NBA и ВТБ\n\n' \
           f'5) Поиск видео на YouTube на баскетбольную тематику\n\n' \
           f'6) Покажу играков дня NBA\n\n' \
           f'7) Музыкальный сборник'

# TODO текст истории баскетбола
history_text = f'В 1891 году в Соединенных Штатах Америки молодой преподаватель, ' \
              f'уроженец Канады, доктор Джеймс Нейсмит, пытаясь “оживить” уроки по гимнастики, ' \
              f'прикрепил две корзины из-под фруктов к перилам балкона и предложил забрасывать туда футбольные мячи. ' \
              f'Игроки перекидывали мяч друг другу и затем пытались закинуть его в корзину. Побеждала команда, забросившая большее количество мячей. ' \
              f'Через год Нейсмит разработал первые правила игры в баскетбол. Первые же матчи по этим правилам вызвали и первые их изменения.' \
              f'Постепенно баскетбол из США проник сначала на Восток – Японию, Китай, Филиппины, а потом в Европу и Южную Америку. ' \

# TODO текст игровых элементов
general_element_text = f'Вот самые популярные элементы, про какой мне рассказать?\n\n' \
               f'1) Перевод мяча на другую руку\n\n' \
               f'2) Пивот\n\n' \
               f'3) Перевод за спиной\n\n' \
               f'4) Перевод мяча между ног\n\n' \
               f'5) StepBack\n\n' \
               f'6) EuroStep'

# TODO текст NBA
nba_text = f'Национа́льная баскетбо́льная ассоциа́ция, НБА — профессиональная баскетбольная лига Северной Америки, в частности, ' \
           f'США и Канады. Входит в четвёрку главных профессиональных спортивных лиг Северной Америки, наряду с НХЛ, МЛБ и НФЛ.' \
           f' Была основана в 1946 году как Баскетбольная ассоциация Америки и, соединившись с Национальной баскетбольной лигой, ' \
           f'была переименована в Национальную баскетбольную ассоциацию.'

# TODO текст ВТБ
vtb_text = 'Единая ли́га ВТБ — баскетбольный турнир, созданный в 2008 году совместно ВТБ и Российской федерацией баскетбола.' \
           ' Он объединил клубы Восточной и Северной Европы. Является официальным соревнованием ФИБА. Имеет статус чемпионата России. ' \
           'Генеральный спонсор лиги — Банк ВТБ. В 2018 году Единая лига ВТБ стала второй в рейтинге европейских чемпионатов.'


# TODO текст для вывода состава команды
conposition_text = f'Состав какой команды мне показать?\n\n' \
                   f'Для этого введите "$название команды"'